АлогистикТест2/src/DataProcessors/алк_РМ_МастераДГ/алк_РМ_МастераДГ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>алк_РМ_МастераДГ</name>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Операция</name>
    <type>
      <types>CatalogRef.алк_ОперацииПроизводства</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Бригада</name>
    <type>
      <types>CatalogRef.Бригады</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Продукция</name>
    <attributes>
      <name>Количество</name>
      <comment>Это Объем</comment>
      <type>
        <types>DefinedType.алк_Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоШтук</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>CatalogRef.СертификатыНаПродукцию</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Персонал</name>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.Должности</types>
      </type>
    </attributes>
    <attributes>
      <name>ФизическоеЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Транспорт</name>
    <attributes>
      <name>ТранспортноеСредство</name>
      <type>
        <types>CatalogRef.ТранспортныеСредства</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Проблемы</name>
    <attributes>
      <name>Проблема</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

АлогистикТест2/src/InformationRegisters/алк_СвободныеСерийныеНомера/алк_СвободныеСерийныеНомера.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_СвободныеСерийныеНомера</name>
  <dimensions>
    <name>СерийныйНомер</name>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/DataProcessors/алк_РМ_МастераДГ/Forms/ПечатьЭтикеток/Module.bsl
&НаКлиенте
Процедура ТаблицаСерийныхНомеровПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Смена") Тогда
		Смена = Параметры.Смена;	
	КонецЕсли;
	
	Если Параметры.Свойство("Номенклатура") И Параметры.Свойство("ДатаСмены") Тогда
		Номенклатура = Параметры.Номенклатура;
		ДатаСмены = Параметры.ДатаСмены;
		ШаблонСерийногоНомера = РфпПолучениеДанныхСервер.ШаблонСерийногоНомераНоменклатурыДляПериода(Номенклатура, НачалоГода(ДатаСмены));
	КонецЕсли;		
	
	Если Параметры.Свойство("МассивВыбранныхПакетов") И Параметры.МассивВыбранныхПакетов <> Неопределено Тогда	
		Для Каждого ВыбранныйПакет Из Параметры.МассивВыбранныхПакетов Цикл
			НоваяСтрока = ТаблицаСерийныхНомеров.Добавить();
			НоваяСтрока.СерийныйНомер = ВыбранныйПакет.Ссылка;	
		КонецЦикла; 
		ПронумероватьТЧСерийныхНомеров();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

Процедура ПронумероватьТЧСерийныхНомеров()
	
	Номер = 1;	
	Для Каждого Стр Из ТаблицаСерийныхНомеров Цикл
		Стр.НомерСтроки = Номер;
		Номер = Номер + 1;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СгенерироватьСерийныеНомера(Команда)
	
	КоличествоГотовых = ТаблицаСерийныхНомеров.Количество();
	
	Если КоличествоГотовых <> 0 Тогда	
		ТекстВопроса = "Уже сгенерированы " + КоличествоГотовых + " серийных номеров.
		| Хотите добавить ещё: " + КоличествоПакетов + "?";
		
		ОписаниеОповещения = Новый ОписаниеОповещения("СгенерироватьСНЗавершение", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);	
	Иначе
		СгенерироватьПакеты();		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура СгенерироватьСНЗавершение(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		СгенерироватьПакеты();
		              	
	КонецЕсли; 
	
КонецПроцедуры 

Процедура СгенерироватьПакеты()
	
	Если ЗначениеЗаполнено(Номенклатура)
		И ЗначениеЗаполнено(ШаблонСерийногоНомера) Тогда
		
		МассивСерийныхНомеров = Новый Массив;	
		
		Для Счетчик = 1 По КоличествоПакетов Цикл			
			
			НовыйНомерСтруктура = РаботаССерийнымиНомерами.ДобавитьСерийныйНомер(Номенклатура, ШаблонСерийногоНомера);
				
			СправочникОбъект                = Справочники.СерийныеНомера.СоздатьЭлемент();
			СправочникОбъект.Владелец		= Номенклатура;
			СправочникОбъект.Наименование	= НовыйНомерСтруктура.НовыйНомер;
			
			Попытка
				СправочникОбъект.Записать();	
			Исключение
				Сообщить(ОписаниеОшибки());
			КонецПопытки;
			
			НоваяСтрока = ТаблицаСерийныхНомеров.Добавить();
			НоваяСтрока.СерийныйНомер = СправочникОбъект.Ссылка;
			
			МассивСерийныхНомеров.Добавить(СправочникОбъект.Ссылка);
			
		КонецЦикла;  	
		
		ПронумероватьТЧСерийныхНомеров();
		
		///Заполнить регистр свободных номеров
		РегистрыСведений.алк_СвободныеСерийныеНомера.ДобавлениеСпискаСерийныхНомеров(МассивСерийныхНомеров);
	
	КонецЕсли;
	
		
КонецПроцедуры

&НаСервере
Процедура ПолучитьСвободныеНомераНаСервере()
	
	ТаблицаСерийныхНомеров.Очистить();
	

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 100
		|	алк_СвободныеСерийныеНомера.СерийныйНомер КАК СерийныйНомер
		|ИЗ
		|	РегистрСведений.алк_СвободныеСерийныеНомера КАК алк_СвободныеСерийныеНомера
		|ГДЕ
		|	алк_СвободныеСерийныеНомера.СерийныйНомер.Владелец = &Владелец
		|	И алк_СвободныеСерийныеНомера.СерийныйНомер.Наименование ПОДОБНО ""%-"" + &Год + ""-%""
		|
		|УПОРЯДОЧИТЬ ПО
		|	СерийныйНомер";
	
	Запрос.УстановитьПараметр("Владелец", Номенклатура);
	Запрос.УстановитьПараметр("Год", Формат((ДатаСмены),"ДФ=yy"));
	
	Если КоличествоПакетов <> 0 Тогда 	
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПЕРВЫЕ 100","ПЕРВЫЕ " + КоличествоПакетов);	
	КонецЕсли; 
		
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрока = ТаблицаСерийныхНомеров.Добавить();
		НоваяСтрока.СерийныйНомер = ВыборкаДетальныеЗаписи.СерийныйНомер;
	КонецЦикла;
		
	ПронумероватьТЧСерийныхНомеров();		
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСвободныеНомера(Команда)
	ПолучитьСвободныеНомераНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПечатьКомплектаЭтикетокНаСервере(ТабДок)
		
	МассивНомеров = Новый Массив;       
	
	Для Каждого Стр Из ТаблицаСерийныхНомеров Цикл
		
		Если (ПечататьС = 0 Или ПечататьС <= Стр.НомерСтроки) 
			И (ПечататьПо = 0 Или ПечататьПо >= Стр.НомерСтроки) Тогда
			МассивНомеров.Добавить(Стр.СерийныйНомер); 		
		КонецЕсли;
		
	КонецЦикла;
	
	//ПечатаемЭтикетку
	ПодстрокиСменаМассив = СтрРазделить(СТрока(Смена), " ");
	
	ДополнительныеПараметрыПечати = Новый Структура;
	ДополнительныеПараметрыПечати.Вставить("ДатаСмены", ДатаСмены);
	ДополнительныеПараметрыПечати.Вставить("Смена", ПодстрокиСменаМассив[0]);
	ДополнительныеПараметрыПечати.Вставить("ПечатьНаПоловинеСтраницы", ПечатьНаПоловинеСтраницы);
	ДополнительныеПараметрыПечати.Вставить("ПечатьНаЧетвертиСтраницы", ПечатьНаЧетвертиСтраницы);

	ТабДок = Обработки.алк_ПечатьЭтикеток.СформироватьПечатнуюФормуЭтикетки_Общая(МассивНомеров,,ДополнительныеПараметрыПечати);

КонецПроцедуры

&НаКлиенте
Процедура ПечатьКомплектаЭтикеток(Команда)
	
	ТабДок = Новый ТабличныйДокумент;
		
	ПечатьКомплектаЭтикетокНаСервере(ТабДок);	
	
	ТабДок.Показать();	
	
КонецПроцедуры
